Masmiseim36/nxpSDK/devices/MIMXRT1186/drivers/fsl_lpi2c.c
                /* If we're out of data, invoke callback to get more. */
                if ((NULL == xfer->data) || (0U == xfer->dataSize))
                {
                    xfer->event = kLPI2C_SlaveTransmitEvent;
                    if (NULL != handle->callback)
                    {
                        handle->callback(base, xfer, handle->userData);
                    }

                    /* Clear the transferred count now that we have a new buffer. */
                    handle->transferredCount = 0U;
                }

                /* Transmit a byte. */
                if ((NULL != xfer->data) && (0U != xfer->dataSize))
                {
                    base->STDR = *xfer->data++;
                    --xfer->dataSize;
                    ++handle->transferredCount;
                }
            }
            if (0U != (flags & (uint32_t)kLPI2C_SlaveRxReadyFlag))
            {
                /* If we're out of room in the buffer, invoke callback to get another. */
                if ((NULL == xfer->data) || (0U == xfer->dataSize))
                {
                    xfer->event = kLPI2C_SlaveReceiveEvent;
                    if (NULL != handle->callback)
                    {
                        handle->callback(base, xfer, handle->userData);
                    }

                    /* Clear the transferred count now that we have a new buffer. */
                    handle->transferredCount = 0U;
                }

                /* Receive a byte. */
                if ((NULL != xfer->data) && (0U != xfer->dataSize))
                {
                    *xfer->data++ = (uint8_t)(base->SRDR & LPI2C_SRDR_DATA_MASK);
                    --xfer->dataSize;
                    ++handle->transferredCount;
                }
                else
                {
                    /* We don't have any room to receive more data, so send a nack. */
                    base->STAR = LPI2C_STAR_TXNACK_MASK;
                }
            }
        }
    }
}

#if !(defined(FSL_FEATURE_I2C_HAS_NO_IRQ) && FSL_FEATURE_I2C_HAS_NO_IRQ)
#if !(defined(FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ) && FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ)
/*!
 * @brief Shared IRQ handler that can call both master and slave ISRs.
 *
 * The master and slave ISRs are called through function pointers in order to decouple
 * this code from the ISR functions. Without this, the linker would always pull in both
 * ISRs and every function they call, even if only the functional API was used.
 *
 * @param base The LPI2C peripheral base address.
 * @param instance The LPI2C peripheral instance number.
 */
static void LPI2C_CommonIRQHandler(LPI2C_Type *base, uint32_t instance)
{
    /* Check for master IRQ. */
    if ((0U != (base->MCR & LPI2C_MCR_MEN_MASK)) && (NULL != s_lpi2cMasterIsr))
    {
        /* Master mode. */
        s_lpi2cMasterIsr(base, s_lpi2cMasterHandle[instance]);
    }

    /* Check for slave IRQ. */
    if ((0U != (base->SCR & LPI2C_SCR_SEN_MASK)) && (NULL != s_lpi2cSlaveIsr))
    {
        /* Slave mode. */
        s_lpi2cSlaveIsr(base, s_lpi2cSlaveHandle[instance]);
    }
    SDK_ISR_EXIT_BARRIER;
}

/*
 * $Branch Coverage Justification$
 * Usage of LPI2C_DriverIRQHandler is device specific.
 */
void LPI2C_DriverIRQHandler(uint32_t instance)
{
    if (instance < ARRAY_SIZE(kLpi2cBases))
    {
        LPI2C_CommonIRQHandler(kLpi2cBases[instance], instance);
    }
    else
    {
        SDK_ISR_EXIT_BARRIER;
    }
}
#endif
#endif

#if defined(LPI2C0)
/* Implementation of LPI2C0 handler named in startup code. */
#if defined(FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ) && FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ
void LPI2C0_Master_IRQHandler(void);
void LPI2C0_Master_IRQHandler(void)
{
    s_lpi2cMasterIsr(LPI2C0, s_lpi2cMasterHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
void LPI2C0_Slave_IRQHandler(void);
void LPI2C0_Slave_IRQHandler(void)
{
    s_lpi2cSlaveIsr(LPI2C0, s_lpi2cSlaveHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#else
void LPI2C0_DriverIRQHandler(void);
void LPI2C0_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C0, 0U);
}
#endif
#endif

#if defined(LPI2C1)
/* Implementation of LPI2C1 handler named in startup code. */
#if defined(FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ) && FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ
void LPI2C1_Master_IRQHandler(void);
void LPI2C1_Master_IRQHandler(void)
{
    s_lpi2cMasterIsr(LPI2C1, s_lpi2cMasterHandle[1]);
    SDK_ISR_EXIT_BARRIER;
}
void LPI2C1_Slave_IRQHandler(void);
void LPI2C1_Slave_IRQHandler(void)
{
    s_lpi2cSlaveIsr(LPI2C1, s_lpi2cSlaveHandle[1]);
    SDK_ISR_EXIT_BARRIER;
}
#else
void LPI2C1_DriverIRQHandler(void);
void LPI2C1_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C1, 1U);
}
#endif
#endif

#if defined(LPI2C2)
/* Implementation of LPI2C2 handler named in startup code. */
void LPI2C2_DriverIRQHandler(void);
void LPI2C2_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C2, 2U);
}
#endif

#if defined(LPI2C3)
/* Implementation of LPI2C3 handler named in startup code. */
void LPI2C3_DriverIRQHandler(void);
void LPI2C3_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C3, 3U);
}
#endif

#if defined(LPI2C4)
/* Implementation of LPI2C4 handler named in startup code. */
void LPI2C4_DriverIRQHandler(void);
void LPI2C4_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C4, 4U);
}
#endif

#if defined(LPI2C5)
/* Implementation of LPI2C5 handler named in startup code. */
void LPI2C5_DriverIRQHandler(void);
void LPI2C5_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C5, 5U);
}
#endif

#if defined(LPI2C6)
/* Implementation of LPI2C6 handler named in startup code. */
void LPI2C6_DriverIRQHandler(void);
void LPI2C6_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C6, 6U);
}
#endif

#if defined(LPI2C7)
/* Implementation of LPI2C7 handler named in startup code. */
void LPI2C7_DriverIRQHandler(void);
void LPI2C7_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C7, 7U);
}
#endif

#if defined(LPI2C8)
/* Implementation of LPI2C8 handler named in startup code. */
void LPI2C8_DriverIRQHandler(void);
void LPI2C8_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(LPI2C8, 8U);
}
#endif

#if defined(CM4_0__LPI2C)
/* Implementation of CM4_0__LPI2C handler named in startup code. */
void M4_0_LPI2C_DriverIRQHandler(void);
void M4_0_LPI2C_DriverIRQHandler(void)
{
    LPI2C_CommonIRQHandler(CM4_0__LPI2C, LPI2C_GetInstance(CM4_0__LPI2C));
}
#endif

